{"/about/":{"data":{"":" Hi, I’m Dhanraj Chavan, a graduate student at New York University specializing in Cybersecurity. I run a personal home lab project as a hobby where I explore innovative technologies in virtualization, network security, and beyond.\nFeel free to connect with me on LinkedIn to share ideas and collaborate."},"title":"About"},"/docs/firewall/":{"data":{"":"","#":"This guide covers the Firewall Configuration for the ProxLink homelab, utilizing pfSense as the primary firewall and router. The firewall sits at the core of the ProxLink network topology and manages traffic between WAN, LAN, and DMZ subnets, as well as access control for services and remote VPN connections via Tailscale.\nFirewall Overview ProxLink uses pfSense, a robust open-source firewall/router software, deployed as a virtual machine inside the Proxmox environment. pfSense handles:\nInter-VLAN Routing NAT and Port Forwarding Traffic Filtering (Inbound \u0026 Outbound) VPN Gateway via Tailscale Access Control between LAN, DMZ, and WAN Interface Mapping Interface pfSense Name Bridge Subnet Purpose net0 WAN vmbr0 192.168.1.0/24 External / Internet access net1 LAN vmbr1 192.168.2.0/24 Internal trusted network net2 DMZ vmbr2 192.168.3.0/24 Exposed services network "},"title":"Firewall Configuration"},"/docs/hardware/":{"data":{"":"","#":"To create a reliable yet compact setup, I’ve carefully selected the following hardware components:\n1. Beelink SER5 Pro Mini PC Processor: AMD Ryzen 7 5800H (8C/16T, Up to 4.4GHz) RAM: 32GB DDR4 Storage: 1TB NVMe SSD Graphics: Integrated AMD Radeon (Supports 4K@60Hz Output) Networking: WiFi 6 (Primary connection) Bluetooth 5.2 Ethernet via WiFi Extender Operating System: Proxmox VE 8.x (Replaces Windows 11 Pro) 2. WiFi Extender (Ethernet Connection) Extends network coverage for Proxmox. Provides an Ethernet bridge for better stability. 3. Cooling System (Optional) An external cooling fan or additional thermal management can be used to maintain performance under high loads. 4. Small Rack for Organization (Optional) A small rack is used to neatly organize the mini PC and manage cables, ensuring a tidy setup and improved airflow. "},"title":"Hardware Configuration"},"/docs/introduction/":{"data":{"":"👋 Welcome to my ProxLink Project Documentation!","configuration#Configuration":" Hardware ConfigurationOverview of the hardware powering the ProxLink. Network ConfigurationManaging virtual networks within Proxmox. Firewall ConfigurationSecuring the network using pfSense firewall rules. VPN ConfigurationEnabling remote access through Tailscale VPN. ","features#Features":" Powerful Virtualization – ProxLink leverages Proxmox VE’s intuitive web interface to efficiently manage virtual machines and containers, ensuring flexibility and scalability.\nRobust Network Security – The lab integrates pfSense firewall/router capabilities, delivering advanced security features, VPN connectivity, and comprehensive network monitoring.\nSeamless Remote Access – TailScale provides secure, reliable remote connectivity within the lab environment, with minimal setup and low-maintenance operation.\nReliable Storage Management – TrueNAS is used for data organization, advanced snapshotting, redundancy, and secure file-sharing, enhancing overall data resilience. (In-Progress)\nExtensible and Customizable – ProxLink offers extensibility through scripting, automation, thorough documentation, and powerful integrations, allowing flexible customization.\nOptimized for Learning and Growth – The project is structured to provide a practical, accessible learning environment suitable for all skill levels, from beginners to experienced IT professionals.","network-topology#Network Topology":"","questions-or-feedback#Questions or Feedback?":" ❓ ProxLink is still in active development. Have a question or feedback? Feel free to open an issue! ","what-is-proxlink#What is ProxLink?":"ProxLink is more than just a project, ProxLink is my exploration into building a versatile home lab using open-source technologies like Proxmox, pfSense, Tailscale, and TrueNAS. It enables me to test cybersecurity concepts, virtualized environments, networking strategies, and software integrations securely and conveniently at home."},"title":"Introduction"},"/docs/network/":{"data":{"":"","#":"This guide outlines how the network topology is structured within the ProxLink homelab infrastructure, which is powered by Proxmox VE, pfSense, and Tailscale.\nOverview ProxLink uses a virtualized network architecture segmented into three main subnets:\nWAN: 192.168.1.0/24 LAN: 192.168.2.0/24 DMZ: 192.168.3.0/24 A pfSense virtual firewall routes and filters traffic between these networks, enabling secure connectivity, isolation, and full-tunnel VPN access.\nTopology Components Proxmox VE Host Acts as the virtualization platform. Provides virtual bridges (vmbr0, vmbr1, vmbr2) to connect VMs to pfSense and the physical network. Virtual Bridges (vmbr) vmbr0 – WAN bridge connected to the router (192.168.1.0/24) vmbr1 – LAN bridge for internal VMs (192.168.2.0/24) vmbr2 – DMZ bridge for exposed services (192.168.3.0/24) pfSense Firewall (VM) Interfaces: net0 (WAN): Connected to vmbr0 net1 (LAN): Connected to vmbr1 net2 (DMZ): Connected to vmbr2 Handles inter-VLAN routing, NAT, firewall rules, and VPN access. Internal VMs Ubuntu Desktop VM Connected to LAN via vmbr1 Ubuntu Server Connected to DMZ via vmbr2 External Network Router Default Gateway: 192.168.1.1 Provides internet access for the Proxmox host and pfSense WAN interface. External Access Devices on the 192.168.1.0/24 subnet can access the pfSense WAN. Tailscale provides full-tunnel VPN access, enabling remote access to internal services securely over the internet. VPN Integration (Tailscale) Full-tunnel VPN routes traffic from external devices through pfSense. Ensures encrypted remote access to LAN and DMZ resources. Subnet Breakdown Network Subnet Purpose Bridge Devices WAN 192.168.1.0/24 External access to Internet vmbr0 pfSense (WAN), Router, Proxmox LAN 192.168.2.0/24 Internal/Trusted VM network vmbr1 Ubuntu Desktop VM DMZ 192.168.3.0/24 Semi-trusted services vmbr2 Ubuntu Server "},"title":"Network Configuration"},"/docs/vpn/":{"data":{"":"","#":"This section covers how VPN access is configured in the ProxLink homelab using Tailscale. Tailscale provides secure, encrypted, and authenticated remote access to internal services across the LAN and DMZ without the complexity of traditional VPNs.\nWhy Tailscale? Tailscale is a mesh VPN built on WireGuard, designed to simplify secure networking across devices and networks. It is ideal for homelabs because:\nZero-config networking over the internet Device-level access control (ACLs) Works through NAT/firewalls Supports full-tunnel VPN routing ProxLink VPN Topology Tailscale is installed directly on the pfSense VM (via a Linux package or Tailscale daemon). pfSense acts as a subnet router and exit node, routing all VPN traffic to internal networks. Remote clients connect to the Tailscale network and gain access to the LAN (192.168.2.0/24) and optionally the DMZ (192.168.3.0/24). "},"title":"VPN Configuration"}}