{"/about/":{"data":{"":" Hi, I’m Dhanraj Chavan, a graduate student at New York University specializing in Cybersecurity. I run a personal home lab project as a hobby where I explore innovative technologies in virtualization, network security, and beyond.\nFeel free to connect with me on LinkedIn to share ideas and collaborate."},"title":"About"},"/docs/firewall/":{"data":{"":" ⚠️ This section is currently in progress and will be updated soon. "},"title":"Firewall Configuration"},"/docs/hardware/":{"data":{"":"","#":"To create a reliable yet compact setup, I’ve carefully selected the following hardware components:\n1. Beelink SER5 Pro Mini PC Processor: AMD Ryzen 7 5800H (8C/16T, Up to 4.4GHz) RAM: 32GB DDR4 Storage: 1TB NVMe SSD Graphics: Integrated AMD Radeon (Supports 4K@60Hz Output) Networking: WiFi 6 (Primary connection) Bluetooth 5.2 Ethernet via WiFi Extender Operating System: Proxmox VE 8.x (Replaces Windows 11 Pro) 2. WiFi Extender (Ethernet Connection) Extends network coverage for Proxmox. Provides an Ethernet bridge for better stability. 3. Cooling System (Optional) An external cooling fan or additional thermal management can be used to maintain performance under high loads. 4. Small Rack for Organization (Optional) A small rack is used to neatly organize the mini PC and manage cables, ensuring a tidy setup and improved airflow. "},"title":"Hardware Configuration"},"/docs/introduction/":{"data":{"":"👋 Welcome to my ProxLink Project Documentation!","configuration#Configuration":" Hardware ConfigurationOverview of the hardware powering the ProxLink. Network ConfigurationManaging virtual networks within Proxmox. Firewall ConfigurationSecuring the network using pfSense firewall rules. VPN ConfigurationEnabling remote access through Tailscale VPN. ","features#Features":" Powerful Virtualization – ProxLink leverages Proxmox VE’s intuitive web interface to efficiently manage virtual machines and containers, ensuring flexibility and scalability.\nRobust Network Security – The lab integrates pfSense firewall/router capabilities, delivering advanced security features, VPN connectivity, and comprehensive network monitoring.\nSeamless Remote Access – TailScale provides secure, reliable remote connectivity within the lab environment, with minimal setup and low-maintenance operation.\nReliable Storage Management – TrueNAS is used for data organization, advanced snapshotting, redundancy, and secure file-sharing, enhancing overall data resilience. (In-Progress)\nExtensible and Customizable – ProxLink offers extensibility through scripting, automation, thorough documentation, and powerful integrations, allowing flexible customization.\nOptimized for Learning and Growth – The project is structured to provide a practical, accessible learning environment suitable for all skill levels, from beginners to experienced IT professionals.","network-topology#Network Topology":"","questions-or-feedback#Questions or Feedback?":" ❓ ProxLink is still in active development. Have a question or feedback? Feel free to open an issue! ","what-is-proxlink#What is ProxLink?":"ProxLink is more than just a project, ProxLink is my exploration into building a versatile home lab using open-source technologies like Proxmox, pfSense, Tailscale, and TrueNAS. It enables me to test cybersecurity concepts, virtualized environments, networking strategies, and software integrations securely and conveniently at home."},"title":"Introduction"},"/docs/network/":{"data":{"":" ⚠️ This section is currently in progress and will be updated soon. "},"title":"Network Configuration"},"/docs/vpn/":{"data":{"":" ⚠️ This section is currently in progress and will be updated soon. "},"title":"VPN Configuration"}}