{"/about/":{"data":{"":"This project is a free and open-sourced tutorial to start a GoFrame project in practice. Please indicate the source for reprinting. Thanks for your reading."},"title":"About"},"/docs/":{"data":{"":"👋 Welcome to my ProxLink Project Documentation!","features#Features":" Powerful Virtualization - Easily manage virtual machines and containers through Proxmox VE’s intuitive web interface, delivering flexibility and scalability for your home lab. Robust Network Security - Leverage PfSense firewall/router integration to provide advanced security, VPN functionality, traffic shaping, and comprehensive monitoring. Seamless Remote Access - Utilize TailScale’s secure VPN solution, allowing secure and reliable remote connectivity with minimal setup and zero-maintenance requirements. Reliable Storage Management - Organize and protect your data efficiently using TrueNAS, offering resilient storage solutions with advanced snapshotting, redundancy, and file-sharing capabilities. Extensible and Customizable - Expand and customize your home lab environment with scripting, automation, detailed documentation, and powerful integrations. Optimized for Learning and Growth - Whether you’re new to virtualization or a seasoned IT pro, ProxLink offers an accessible learning environment and practical tools to build expertise. ","network-topology#Network Topology":"","next#Next":"Dive right into the following section to get started:\nGetting StartedLearn how to create website using Hextra ","questions-or-feedback#Questions or Feedback?":" ❓ ProxLink is still in active development. Have a question or feedback? Feel free to open an issue! ","what-is-proxlink#What is ProxLink?":"ProxLink is my personal project, showcasing a modern, powerful, and scalable home lab solution built using Proxmox VE. I’ve enhanced it with advanced networking, security, and storage capabilities, designed specifically for home enthusiasts, students, and IT professionals. ProxLink simplifies virtualization, networking, and storage management through an intuitive, efficient, and secure environment, reflecting my passion for technology and innovation."},"title":"Documentation"},"/docs/installation/":{"data":{"":" ProxmoxInstall \u0026 setup proxmox Virtual MachinesSetup VMs PfSenseDownload \u0026 Install PfSense Firewall "},"title":"Installation"},"/docs/installation/proxmox/":{"data":{"":"Test"},"title":"Proxmox"}}